#include<iostream>
using namespace std;

void main()
{
	setlocale(LC_ALL, "Rus");
	int n;
	cout << "¬ведите размер доски: "; cin >> n;
	for (int i = 0; i < n; i++)
	{
		for (int j = 0; j < n; j++) //ѕовтор€ет вывод больших строк *****     *****     *****, таким образом, что выходит строка из больших квадратов.
		{
			//cout << "* ";
			//cout << ((i + j) % 2 == 0 ? "+ " : "- ");
			for (int k = 0; k < n; k++)	//ѕовтор€ет вывод маленькой строки из "* " либо "  "
			{
				for (int l = 0; l < n; l++)	//ѕовтор€ет вывод одного символа "* ", "  "
				{
					cout << ((i + k) % 2 == 0 ? "* " : "  ");
				}
			}
			cout << endl;
		}
	}
}