https://github.com/okovtun/BD_122.git
https://www.youtube.com/watch?v=dKTDtpYuCPA&list=PLeqyOOqxeiIPJFPkv6UtPmvC9oMjaKCuO&index=1

TOREAD:
https://www.softelectro.ru/ieee754.html

TODO:
1. Написать программу, которая вычисляет факториал числа, введенного с клавиатуры;
2. Используя цикл for написать программу, которая, указанное число возводит в указанную степень;
3. Вывести на экран таблицу ASCII-символов по 16 символов в строке;

DONE:
Реализовать Shooter при помощи switch;

DONE:
1. Написать калькулятор, с использованием конструкции switch;
2. Написать программу, которая определяет, является ли введенное число палиндромом
   Палиндром - это число, которое в обоих направлениях читается одинаково, например:
   121;
   12321;
   1221;
   Подсказка: while;
   https://github.com/okovtun/BD_122/blob/master/DataTypes/DataTypes.pdf

DONE:
Что будет выведено на экран в следующих случаях
//1.
int i = 3;
i = ++i + ++i;
cout << i << endl;	//10
----------------------------------------------
2.
int i = 3;
i = i++ + ++i;
cout << i << endl;	//9
----------------------------------------------
3.
int i = 3;
i = i++ + 1 + ++i * 2;
cout << i << endl;
----------------------------------------------
4.
int i = 3;
i = i++ + 1 + ++i *= 2;
cout << i << endl;
----------------------------------------------
5.
int i = 3;
i += i++ + 1 + ++i *= 2;
cout << i << endl;
===============================================================

DONE:
Используя вывод на экран и Escape-последовательности
вывести в окно консоль стишок "В лесу родилась Ёлочка".
В MyStat прислать *.cpp-файл.

Выучить теорию!!!
В ответ на домашку в MyStat прислать файл "Выучил.txt"