https://github.com/okovtun/BD_122.git
https://www.youtube.com/watch?v=dKTDtpYuCPA&list=PLeqyOOqxeiIPJFPkv6UtPmvC9oMjaKCuO&index=1

TheCherno:
https://www.youtube.com/watch?v=18c3MTX0PK0&list=PLlrATfBNZ98dudnM48yfGUldqGD0S4FFb

//////////////////////////////////////////////////////////////
//////////////				Arrays			//////////////////
//////////////////////////////////////////////////////////////
https://www.youtube.com/watch?v=ENDaJi08jCU&list=PLlrATfBNZ98dudnM48yfGUldqGD0S4FFb&index=31
https://drive.google.com/file/d/1UXYIbYzXBLsUxvNBRpsser9I39oKJihP/view?usp=sharing

TODO:
1. Обеспечить сдвиг массива влево, или вправо, по выбору пользователя. 
   На сколько элементов сдвинуть массив так же выбирает пользователь;
2. Пользователь вводит десятичное число. Программа преобразует это десятичное число
   в двоичную систему счисления, и выводит двоичное число на экран;
3. Пользователь вводит десятичное число. Программа преобразует это десятичное число
   в шестнадцатеричную систему счисления, и выводит шестнадцатеричное число на экран;
   https://github.com/okovtun/BD_011/blob/master/NumericSystems.pdf


DONE:
0. Для массива, введенного с клавиатуры найти сумму и среднее арифметическое;
1. Найти в массиве минимальное и максимальное значение;
2. Есть массив из десяти элементов, проинициализированный рядом 1, 2, 3, 4.....9, 10.
   Необходимо выполнить циклический сдвиг массива массива влево.
   На сколько элементов сдвинуть массив пользователь вводит с клавиатуры.
   Например:
	1	2	3	4	5	6	7	8	9	10	- исходный массив
	4	5	6	7	8	9	10	1	2	3	- массив сдвинутый на 3 элемента влево

//////////////////////////////////////////////////////////////
//////////////		Control structures		//////////////////
//////////////////////////////////////////////////////////////

TOREAD:
https://github.com/okovtun/BD_011/blob/master/NumericSystems.pdf

DONE:
1. Зарегистрироваться на github.com;
2. https://github.com/okovtun/BV_011/blob/master/ControlStructures/Geometria/Task/ChessBoard.jpg;
3. https://github.com/okovtun/BV_011/blob/master/ControlStructures/Geometria/Task/HardChess.jpg;

DONE:
https://github.com/okovtun/BV_011/blob/master/ControlStructures/Geometria/Task/Geometria1.txt

DONE:
1. Написать программу, которая вычисляет факториал числа, введенного с клавиатуры;
2. Используя цикл for написать программу, которая, указанное число возводит в указанную степень;
3. Вывести на экран таблицу ASCII-символов по 16 символов в строке;

DONE:
Реализовать Shooter при помощи switch;

DONE:
1. Написать калькулятор, с использованием конструкции switch;
2. Написать программу, которая определяет, является ли введенное число палиндромом
   Палиндром - это число, которое в обоих направлениях читается одинаково, например:
   121;
   12321;
   1221;
   Подсказка: while;
   https://github.com/okovtun/BD_122/blob/master/DataTypes/DataTypes.pdf

DONE:
Что будет выведено на экран в следующих случаях
//1.
int i = 3;
i = ++i + ++i;
cout << i << endl;	//10
----------------------------------------------
2.
int i = 3;
i = i++ + ++i;
cout << i << endl;	//9
----------------------------------------------
3.
int i = 3;
i = i++ + 1 + ++i * 2;
cout << i << endl;
----------------------------------------------
4.
int i = 3;
i = i++ + 1 + ++i *= 2;
cout << i << endl;
----------------------------------------------
5.
int i = 3;
i += i++ + 1 + ++i *= 2;
cout << i << endl;
===============================================================

TOREAD:
https://www.softelectro.ru/ieee754.html

DONE:
Используя вывод на экран и Escape-последовательности
вывести в окно консоль стишок "В лесу родилась Ёлочка".
В MyStat прислать *.cpp-файл.

Выучить теорию!!!
В ответ на домашку в MyStat прислать файл "Выучил.txt"