#include<iostream>	//cin/cout
//using namespace std;//cin/cout

void main()
{
	std::cout << "Hello World!";
}

//Ctrl + F7 - Компиляция
//Ctrl + F5 - Запуск

/*
----------------------------------------------
#include<iostream>
# показывает, что include - это директива
Директива - это указание компилятору на 
выполнение некоторых действий.
Директива #include указывает компилятору на то, 
что к нашему исходному файлу нужно подключить другой файл,
в даном случае - iostream.

<iostream> содержит потоки ввода/вывода - cin/cout
----------------------------------------------
*/